{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"rich-text":{"type":"rich-text","blocks":{"heading":{"type":"heading","settings":{"title":"THE SCIENCE OF BEAUTIFUL SKIN"}},"text":{"type":"text","settings":{"enlarge_text":true,"text":"<p>Our skin. Protecting us, keeping us healthy and looking our best to everyone we meet.<\/p><p>Applying products to care for our skin should be done with care. It is called Skin<strong>Care<\/strong> after all. In today’s world, people are more in touch and better educated than ever before with their own health and well-being, and yet, we are still surrounded by trendy scientific buzzwords like ‘must have’ ingredients and hopes that a new skincare brand has your skin's best interest at heart.<\/p><p>And now more than ever, you are allowed to ask questions of the products you apply to your skin and how they work <strong>FOR YOU<\/strong>.<\/p><p>Genucel products rely on conclusive research, natural ingredients, and a proprietary base to create products that can truly help make your skin noticeably younger and more radiant.<\/p><p>With products that demonstrate results that you can actually see, ingredients that tackle specific problem areas, proprietary delivery systems that ensure these ingredients go where they need to within the layers of your skin, you can be sure that Genucel is working for your skin.<\/p><p>It’s important to be transparent about our ingredients and educational about our industry. We believe that in skincare, every exciting announcement or statement about an ingredient or result should be backed up immediately by the science, the how… the why… and the ways it can benefit you and your skin.<\/p>"}}},"block_order":["heading","text"],"settings":{"align_text":"center","narrow_column":false,"divider":false}},"text_and_image_tCTT9e":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Genucel_Skin_Care_Dropper.jpg","image_mask":"none","image2_mask":"none","subtitle":"","title":"Calendula","text":"<p>Many of our products begin life in the same way, as a silky smooth anti-oxidant, proprietary cream base, and from there, the magic happens. We develop products for specific skin concerns and general skin health. So, let’s talk about the antioxidant powerhouse of our proprietary base, let us introduce our dear friend, <strong>Calendula.<\/strong><\/p><p>Native to the Mediterranean region, Calendula is a stunning yellow flowering plant. Packed with antioxidants, it effectively protects delicate skin, which makes it the perfect foundation for our products.<\/p><p>Calendula is naturally packed with Linoleic Acid - an abundant fatty acid naturally found in the skin’s moisture barrier. Because of this, it is one of the few extracts that helps skin visibly maintain ideal moisture levels.<\/p><p>Calendula also increases the effectiveness of the other active ingredient present in our skincare products. Safe enough even for those with extreme sensitivity, Calendula is a natural ingredient that serves as a nourishing foundation for nearly all our products.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"right","divider":false,"top_padding":false,"bottom_padding":false,"lazyload_images":true}},"text_and_image_RKj4dq":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Genucel_Skin_Care_Bottle.jpg","image_mask":"none","image2_mask":"none","subtitle":"","title":"Vitamin C","text":"<p>Vitamin C is another essential ingredient when it comes to the health and radiance of your skin. Rich in antioxidants, Vitamin C impacts skin's natural restorative process, which helps your body maintain the health of your skin. Research suggests that topical Vitamin C can visibly improve the appearance of dark spots and increase skin brightness, improve the appearance of wrinkles on the face and neck while also visibly refining skin’s overall texture and appearance.  <\/p><p>Genucel Vitamin C products stand alone because of cutting-edge Liposomal Skincare Technology.  Liposomes are spheres made up of phospholipids that carry vitamin C at their core. Liposomal Technology maximizes the delivery of pure Vitamin C to the layers of the skin that need it most.  Unlike Genucel, water based serums do not deliver the effective goodness of Vitamin C to the layers of skin that need it most.  <\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"left","divider":false,"top_padding":false,"bottom_padding":false,"lazyload_images":true}},"text_and_image_LNqHUK":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Genucel_Skin_Care_Bottle_2.jpg","image_mask":"none","image2_mask":"none","subtitle":"","title":"Hyaluronic Acid","text":"<p>Hyaluronic Acid is a popular skincare buzzword. Long before it was touted as a miracle skin care solution, it was recognized to have immense benefits on the appearance of aging skin. Hyaluronic Acid is responsible for providing your skin with a noticeably plump, hydrated look that is associated with younger skin.<\/p><p>Hyaluronic Acid creates highly moisturized skin that appears visibly smoother, firmer, and more radiant. This compound helps reduce the appearance of wrinkles and leaves your skin looking younger.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"right","divider":false,"top_padding":false,"bottom_padding":false,"lazyload_images":true}},"text_and_image_mbGAGd":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Genucel_Skin_Care_Dropper_3.jpg","image_mask":"none","image2_mask":"none","subtitle":"","title":"Matrixyl","text":"<p>In recent years, science has uncovered the incredible benefits that remarkable peptide Matrixyl has on the skin. A gentler alternative to a traditional retinol, Matrixyl visibly improves skin suppleness and maintains visibly healthier looking skin. Studies have revealed that regular use of Matrixyl results in a noticeable improvement in the appearance of fine lines and wrinkles<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"left","divider":false,"top_padding":false,"bottom_padding":false,"lazyload_images":true}},"text_and_image_zPzhtG":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/Genucel_Skin_Care_Apple.jpg","image_mask":"none","image2_mask":"none","subtitle":"","title":"Malus Domestica Extracts","text":"<p>Perhaps the most breakthrough ingredient used in genucel skin care products is the Malus Domestica - Uttweiler Spatlauber - extract. Just like other natural extracts, these highly concentrated, rare Swiss apple extract is rich in antioxidants and gently soothes all skin types while also encouraging a youthful appearance.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","image_width":"50","layout":"right","divider":false,"top_padding":false,"bottom_padding":false,"lazyload_images":true}},"rich_text_htQNxH":{"type":"rich-text","blocks":{"heading_NndfFA":{"type":"heading","settings":{"title":"The Genucel Difference"}},"text_rtXQfL":{"type":"text","settings":{"enlarge_text":true,"text":"<p>Your skin is your first appearance to the world - every single thing applied to it greatly impacts your overall health, appearance, wellness. Genucel is rooted in stripping away all the embellishments like mineral oil, parabens, and pharmaceutical byproducts that are often more harmful than beneficial to your skin.  Genucel Skin Care is evidence based with actual results from real customers and goodness of product. The Genucel philosophy towards natural skin care is simple: cultivating the science of beautiful skin.<\/p>"}}},"block_order":["heading_NndfFA","text_rtXQfL"],"settings":{"align_text":"center","narrow_column":false,"divider":false}},"text_with_icons_ngVHxm":{"type":"text-with-icons","blocks":{"text_block_jDN3cR":{"type":"text_block","settings":{"icon":"charity","title":"Good for you","text":"<p>We're cautious of our ingredient selection and use only the best.<\/p>"}},"text_block_arQfAm":{"type":"text_block","settings":{"icon":"ribbon","title":"Made to perform","text":"<p>Breakthrough formulas that are designed and tested thoroughly.<\/p>"}},"text_block_NGcwQr":{"type":"text_block","settings":{"icon":"plant","title":"100% transparency","text":"<p>We <strong>never<\/strong> test on animals during any stage of product development.<\/p>"}}},"block_order":["text_block_jDN3cR","text_block_arQfAm","text_block_NGcwQr"],"settings":{"title":"Why Our Products?","align_text":"center","desktop_columns_per_row":3,"icon_color":"#8b1d41","button_label":"","button_link":"","divider":true}}},"order":["main","rich-text","text_and_image_tCTT9e","text_and_image_RKj4dq","text_and_image_LNqHUK","text_and_image_mbGAGd","text_and_image_zPzhtG","rich_text_htQNxH","text_with_icons_ngVHxm"]}